CSI API ETABS v1

# cPluginCallbackFinish Method

---

This method must be called when the plugin has finished.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    void Finish(
    	int iVal
    )

    Sub Finish (
    	iVal As Integer
    )

    Dim instance As cPluginCallback
    Dim iVal As Integer

    instance.Finish(iVal)

    void Finish(
    	int iVal
    )

    abstract Finish :
            iVal : int -> unit

#### Parameters

iVal

    Type: SystemInt32
Sets the ErrorFlag property

See Also

#### Reference

cPluginCallback Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com